05-01-simbolos-constantes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt-br" xml:lang="pt-br">
<head>
<!-- 2022-10-24 seg 00:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Símbolos constantes</title>
<meta name="author" content="Lucas S. Vieira" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./main.css" />
<link rel="stylesheet" type="text/css" href="./syntax.css" />
<link id="theme-css" rel="stylesheet" type="text/css" href="./dark-theme.css" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta property="og:image" content="../img/cat-i-mage.jpg">
<meta name="theme-color" content="#14171e">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="05-axiomas.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Símbolos constantes</h1>
<p>
Arquivo: <code>axioms/definitions.rs</code>.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::<span style="color: #4ec9b0;">MajState</span>;
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::<span style="color: #4ec9b0;">Maj</span>;
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">num_derive</span>::<span style="color: #4ec9b0;">FromPrimitive</span>;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[derive(Debug, FromPrimitive)]</span>
<span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">enum</span> <span style="color: #4ec9b0;">MajRawSym</span> {
    <span style="color: #4ec9b0;">Nil</span>            = 0,
    <span style="color: #4ec9b0;">T</span>              = 1,
    <span style="color: #4ec9b0;">Prim</span>           = 2,
    <span style="color: #4ec9b0;">Lit</span>            = 3,
    <span style="color: #4ec9b0;">Closure</span>        = 4,
    <span style="color: #4ec9b0;">Error</span>          = 5,
    <span style="color: #4ec9b0;">Fn</span>             = 6,
    <span style="color: #4ec9b0;">Ampersand</span>      = 7,
    <span style="color: #4ec9b0;">Apply</span>          = 8,
    <span style="color: #4ec9b0;">Macro</span>          = 9,
    <span style="color: #4ec9b0;">Mac</span>            = 10,
    <span style="color: #4ec9b0;">Quote</span>          = 11,
    <span style="color: #4ec9b0;">Unquote</span>        = 12,
    <span style="color: #4ec9b0;">UnquoteSplice</span>  = 13,
    <span style="color: #4ec9b0;">Quasiquote</span>     = 14,
    <span style="color: #4ec9b0;">Do</span>             = 15,
    <span style="color: #4ec9b0;">Integer</span>        = 16,
    <span style="color: #4ec9b0;">Float</span>          = 17,
    <span style="color: #4ec9b0;">Fraction</span>       = 18,
    <span style="color: #4ec9b0;">Complex</span>        = 19,
    <span style="color: #4ec9b0;">Vector</span>         = 20,
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_gen_symbols</span>(<span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>) {
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Order matters here</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">_</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"nil"</span>);            <span style="color: #6a9955;">// </span><span style="color: #6a9955;">0</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">_</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"t"</span>);              <span style="color: #6a9955;">// </span><span style="color: #6a9955;">1</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">_</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"prim"</span>);           <span style="color: #6a9955;">// </span><span style="color: #6a9955;">2</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">_</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"lit"</span>);            <span style="color: #6a9955;">// </span><span style="color: #6a9955;">3</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">_</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"closure"</span>);        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">4</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">_</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"error"</span>);          <span style="color: #6a9955;">// </span><span style="color: #6a9955;">5</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">_</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"fn"</span>);             <span style="color: #6a9955;">// </span><span style="color: #6a9955;">6</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">_</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"&amp;"</span>);              <span style="color: #6a9955;">// </span><span style="color: #6a9955;">7</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">_</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"apply"</span>);          <span style="color: #6a9955;">// </span><span style="color: #6a9955;">8</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">_</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"macro"</span>);          <span style="color: #6a9955;">// </span><span style="color: #6a9955;">9</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">_</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"mac"</span>);            <span style="color: #6a9955;">// </span><span style="color: #6a9955;">10</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">_</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"quote"</span>);          <span style="color: #6a9955;">// </span><span style="color: #6a9955;">11</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">_</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"unquote"</span>);        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">12</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">_</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"unquote-splice"</span>); <span style="color: #6a9955;">// </span><span style="color: #6a9955;">13</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">_</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"quasiquote"</span>);     <span style="color: #6a9955;">// </span><span style="color: #6a9955;">14</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">_</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"do"</span>);             <span style="color: #6a9955;">// </span><span style="color: #6a9955;">15</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">_</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"integer"</span>);        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">16    </span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">_</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"float"</span>);          <span style="color: #6a9955;">// </span><span style="color: #6a9955;">17</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">_</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"fraction"</span>);       <span style="color: #6a9955;">// </span><span style="color: #6a9955;">18</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">_</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"complex"</span>);        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">19</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">_</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"vector"</span>);         <span style="color: #6a9955;">// </span><span style="color: #6a9955;">20</span>
}
</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Lucas S. Vieira</p>
<p class="date">Created: 2022-10-24 seg 00:27</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
